In [1]:
import pandas as pd
import numpy as np
#import random

In [2]:
# 데이터 그래프 시각화 하기전 설정
import matplotlib.pyplot as plt
%matplotlib inline
%config InlineBackend.figure_format='retina'
# 한글 설정.
plt.rc("font", family="Malgun Gothic")
plt.rc("axes", unicode_minus=False) # y축
#경고 메세지 안보이게
import warnings
warnings.filterwarnings(action='ignore')
# warnings.filterwarnings(action='default')

In [3]:
# 범례를 차트밖에 빼기.

# g.plot(kind='bar', rot=0, figsize=(10,3))
# plt.legend(bbox_to_anchor=(1.05, 1), loc=2, borderaxespad=0.)

In [4]:
# 2-1 2013년9월부터 2015년8월까지 데이터는 df_first 변수에 담아 탐색
df_first = pd.read_csv('data/전국 평균 분양가격(2013년 9월부터 2015년 8월까지).csv', encoding='cp949')
df_first.head()

,지역,2013년12월,2014년1월,2014년2월,2014년3월,2014년4월,2014년5월,2014년6월,2014년7월,2014년8월,...,2014년11월,2014년12월,2015년1월,2015년2월,2015년3월,2015년4월,2015년5월,2015년6월,2015년7월,2015년8월
0,서울,18189,17925,17925,18016,18098,19446,18867,18742,19274,...,20242,20269,20670,20670,19415,18842,18367,18374,18152,18443
1,부산,8111,8111,9078,8965,9402,9501,9453,9457,9411,...,9208,9208,9204,9235,9279,9327,9345,9515,9559,9581
2,대구,8080,8080,8077,8101,8267,8274,8360,8360,8370,...,8439,8253,8327,8416,8441,8446,8568,8542,8542,8795
3,인천,10204,10204,10408,10408,10000,9844,10058,9974,9973,...,10020,10020,10017,9876,9876,9938,10551,10443,10443,10449
4,광주,6098,7326,7611,7346,7346,7523,7659,7612,7622,...,7752,7748,7752,7756,7861,7914,7877,7881,8089,8231

In [5]:
df_first.tail()

,지역,2013년12월,2014년1월,2014년2월,2014년3월,2014년4월,2014년5월,2014년6월,2014년7월,2014년8월,...,2014년11월,2014년12월,2015년1월,2015년2월,2015년3월,2015년4월,2015년5월,2015년6월,2015년7월,2015년8월
12,전북,6282,6281,5946,5966,6277,6306,6351,6319,6436,...,6583,6583,6583,6583,6542,6551,6556,6601,6750,6580
13,전남,5678,5678,5678,5696,5736,5656,5609,5780,5685,...,5768,5784,5784,5833,5825,5940,6050,6243,6286,6289
14,경북,6168,6168,6234,6317,6412,6409,6554,6556,6563,...,6881,6989,6992,6953,6997,7006,6966,6887,7035,7037
15,경남,6473,6485,6502,6610,6599,6610,6615,6613,6606,...,7125,7332,7592,7588,7668,7683,7717,7715,7723,7665
16,제주,7674,7900,7900,7900,7900,7900,7914,7914,7914,...,7724,7739,7739,7739,7826,7285,7285,7343,7343,7343

In [6]:
# 2-2 이후 데이터는 df_last 변수에 담아 탐색
df_last = pd.read_csv('data/주택도시보증공사_전국 신규 민간아파트 분양가격 동향_20210215.csv', encoding='cp949')
df_last.head()

  지역명               규모구분    연도   월 분양가격(㎡)
0  서울               모든면적  2015  10    5841
1  서울         전용면적 60㎡이하  2015  10    5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  서울        전용면적 102㎡초과  2015  10    5879

In [7]:
df_last.tail()

     지역명               규모구분    연도  월 분양가격(㎡)
5435  제주               모든면적  2021  1    5199
5436  제주         전용면적 60㎡이하  2021  1    4686
5437  제주   전용면적 60㎡초과 85㎡이하  2021  1    5203
5438  제주  전용면적 85㎡초과 102㎡이하  2021  1     NaN
5439  제주        전용면적 102㎡초과  2021  1     NaN

In [8]:
# 3. df_last의 데이터 결측치를 확인하고 대체할지 고민한다.
df_last.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5440 entries, 0 to 5439
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지역명      5440 non-null   object
 1   규모구분     5440 non-null   object
 2   연도       5440 non-null   int64
 3   월        5440 non-null   int64
 4   분양가격(㎡)  5010 non-null   object
dtypes: int64(2), object(3)
memory usage: 212.6+ KB

In [9]:
df_last.isna().sum() # 분양가격(㎡)의 결측치 갯수 : 430.

지역명          0
규모구분         0
연도           0
월            0
분양가격(㎡)    430
dtype: int64

In [10]:
df_last["분양가격(㎡)"]

0       5841
1       5652
2       5882
3       5721
4       5879
        ...
5435    5199
5436    4686
5437    5203
5438     NaN
5439     NaN
Name: 분양가격(㎡), Length: 5440, dtype: object

In [11]:
df_last["분양가격(㎡)"] = pd.to_numeric(df_last["분양가격(㎡)"], errors='coerce')
df_last.head(3)

  지역명              규모구분    연도   월  분양가격(㎡)
0  서울              모든면적  2015  10   5841.0
1  서울        전용면적 60㎡이하  2015  10   5652.0
2  서울  전용면적 60㎡초과 85㎡이하  2015  10   5882.0

In [12]:
# 4. df_last 데이터셋에 평당분양가격 컬럼을 추가한다.
df_last["평당분양가격"] = df_last["분양가격(㎡)"]*3.3
df_last.head(4)

  지역명               규모구분    연도   월  분양가격(㎡)   평당분양가격
0  서울               모든면적  2015  10   5841.0  19275.3
1  서울         전용면적 60㎡이하  2015  10   5652.0  18651.6
2  서울   전용면적 60㎡초과 85㎡이하  2015  10   5882.0  19410.6
3  서울  전용면적 85㎡초과 102㎡이하  2015  10   5721.0  18879.3

In [13]:
# 5. df_last 데이터셋에서 전용면적 컬럼을 추가한다(아래와 같이 규모구분 컬럼을 이용한다)
df_last["전용면적"] = df_last["규모구분"].str.replace("전용면적","")
df_last["전용면적"] = df_last["전용면적"].str.replace("초과","~")
df_last["전용면적"] = df_last["전용면적"].str.replace("이하","")
df_last["전용면적"] = df_last["전용면적"].str.replace(" ","").str.strip()
df_last["전용면적"]

0           모든면적
1            60㎡
2        60㎡~85㎡
3       85㎡~102㎡
4          102㎡~
          ...
5435        모든면적
5436         60㎡
5437     60㎡~85㎡
5438    85㎡~102㎡
5439       102㎡~
Name: 전용면적, Length: 5440, dtype: object

In [14]:
# 6. 메모리 사용량을 줄이기 위해 사용하지 않을 컬럼은 제거한 후
# (df_last.drop([‘규모구분’,’분양가격((㎡)’], axis=1 이용), 메모리 사용량을 전후로 확인한다.
# 사용하지 않을 컬럼을 삭제하기전, 메모리 사용량. -> memory usage: 297.6+ KB
df_last.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5440 entries, 0 to 5439
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지역명      5440 non-null   object
 1   규모구분     5440 non-null   object
 2   연도       5440 non-null   int64
 3   월        5440 non-null   int64
 4   분양가격(㎡)  4918 non-null   float64
 5   평당분양가격   4918 non-null   float64
 6   전용면적     5440 non-null   object
dtypes: float64(2), int64(2), object(3)
memory usage: 297.6+ KB

In [60]:
# 사용하지 않을 컬럼 삭제.
df_last = df_last.drop(['규모구분','분양가격(㎡)'], axis=1) # axis=1 열 별로.
df_last.head(3)

  지역명    연도   월   평당분양가격     전용면적
0  서울  2015  10  19275.3     모든면적
1  서울  2015  10  18651.6      60㎡
2  서울  2015  10  19410.6  60㎡~85㎡

In [15]:
# 사용하지 않을 컬럼을 삭제한 후, 메모리 사용량. -> memory usage: 212.6+ KB
df_last.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5440 entries, 0 to 5439
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지역명      5440 non-null   object
 1   규모구분     5440 non-null   object
 2   연도       5440 non-null   int64
 3   월        5440 non-null   int64
 4   분양가격(㎡)  4918 non-null   float64
 5   평당분양가격   4918 non-null   float64
 6   전용면적     5440 non-null   object
dtypes: float64(2), int64(2), object(3)
memory usage: 297.6+ KB

In [66]:
# 7. GroupBy(unstack()함수 이용) vs. pivot_table
# 7-1. 지역별 데이터 수.
df_last
# area_count = df_last.groupby('지역명').count()
# area_count

     지역명    연도   월   평당분양가격      전용면적
0     서울  2015  10  19275.3      모든면적
1     서울  2015  10  18651.6       60㎡
2     서울  2015  10  19410.6   60㎡~85㎡
3     서울  2015  10  18879.3  85㎡~102㎡
4     서울  2015  10  19400.7     102㎡~
...   ..   ...  ..      ...       ...
5435  제주  2021   1  17156.7      모든면적
5436  제주  2021   1  15463.8       60㎡
5437  제주  2021   1  17169.9   60㎡~85㎡
5438  제주  2021   1      NaN  85㎡~102㎡
5439  제주  2021   1      NaN     102㎡~

[5440 rows x 5 columns]

In [16]:
# 7-2. 지역별 평당분양가격 (평균)
df_last.groupby(["지역명"])["평당분양가격"].mean()

지역명
강원     8390.571287
경기    13713.354286
경남     9589.627451
경북     8690.617347
광주    10756.677481
대구    12691.950489
대전    10412.425105
부산    12351.711429
서울    24867.846667
세종     9975.354231
울산    10736.290355
인천    12566.219614
전남     7961.468932
전북     7896.046006
제주    11743.878161
충남     8414.014430
충북     7786.956230
Name: 평당분양가격, dtype: float64

In [17]:
# 7-3. 전용면적별 평당분양가격(평균)
df_last.groupby(["전용면적"])["평당분양가격"].mean()

전용면적
102㎡~       11987.947280
60㎡         10802.735170
60㎡~85㎡     10694.895726
85㎡~102㎡    11733.047719
모든면적        10702.628125
Name: 평당분양가격, dtype: float64

In [23]:
# 7-4. 지역별, 전용면적별 평당분양가격(평균)
df_last.groupby(["지역명","전용면적"])["평당분양가격"].mean()

지역명  전용면적
강원   102㎡~       9367.547619
     60㎡         8054.357143
     60㎡~85㎡     7854.523810
     85㎡~102㎡    8896.476471
     모든면적        7876.314286
                    ...
충북   102㎡~       8383.466667
     60㎡         7294.152381
     60㎡~85㎡     7416.619048
     85㎡~102㎡    8481.757377
     모든면적        7380.842857
Name: 평당분양가격, Length: 85, dtype: float64

In [24]:
# 7-5. 연도, 지역별 평당분양가격(평균) -> unstack()
df_last.groupby(["지역명","연도"])["평당분양가격"].mean().unstack()

연도,2015,2016,2017,2018,2019,2020,2021
지역명,,,,,,,
강원,7188.060,7162.903846,7273.560000,8219.255000,8934.475000,10302.423214,11169.18
경기,11060.940,11684.970000,12304.980000,14258.420000,15665.540000,15106.080000,14823.60
경남,8459.220,8496.730000,8786.760000,9327.670000,10697.615789,10919.272222,11079.42
경북,7464.160,7753.405000,8280.800000,8680.776923,9050.250000,9997.693750,11281.38
광주,7916.700,9190.683333,9613.977551,9526.953333,12111.675000,13406.485714,13445.52
대구,9018.900,10282.030000,12206.700000,12139.252632,14081.650000,15314.200000,15640.02
대전,8190.600,8910.733333,9957.158491,10234.106667,12619.200000,11238.844737,10444.50
부산,10377.400,10743.535000,11560.680000,12889.965000,13537.865000,13353.010000,13565.64
서울,20315.680,21753.435000,21831.060000,23202.245000,28286.830000,29781.015000,29303.34
세종,8765.020,8857.805000,9132.505556,10340.463158,11299.394118,11628.100000,12502.38
울산,9367.600,9582.574138,10666.935714,10241.400000,10216.250000,12837.600000,14493.60
인천,10976.020,11099.055000,11640.600000,11881.532143,13249.775000,14982.990000,15589.20
전남,6798.880,6936.600000,7372.920000,7929.845000,8219.275862,9562.398214,9680.22
전북,7110.400,6906.625000,7398.973585,8174.595000,8532.260000,8559.430000,8457.24
제주,7951.075,9567.480000,12566.730000,11935.968000,11828.469231,14192.876923,16596.80
충남,7689.880,7958.225000,8198.422222,8201.820000,8748.840000,9139.380000,9216.90
충북,6828.800,7133.335000,7473.120000,8149.295000,7970.875000,8358.956897,8766.78

In [22]:
# 8. 위의 그룹화한 내용을 선그래프와 막대그래프로 시각화
# 연도별(월별 데이터로), 전용면적별 box플롯

In [23]:
# 9. seaborn 으로 시각화(위에서 그린 시각화내용을 일부 또는 그 이상을 seaborn으로 시각화)
# 9-1. 지역별 평당분양가격(평균)

In [24]:
# 9-2. 연도별 평당분양가격(평균)

In [25]:
# 9-3. 그외도 추가

In [26]:
# 10.구조가 다른 df_first와 df_last의 전용면적 전체의 데이터를 
#하나의 같은 데이터 셋으로 합쳐서 분석을 한다. 분석은 위의 내용을 참조하여 각자 분석한다.